//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// /*++
// Copyright (c) 2011-2021 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#

#include "Strings.uni"

#string STR_ME_FORM                             #language en-US "ME Configuration"
#string STR_ME_FORM_HELP                        #language en-US "Configure Management Engine Technology Parameters"

#string STR_ME_SUBTITLE                         #language en-US "Management Engine Technology Configuration"
//---------------------------------------------------------------------------
// ME Configuration
//---------------------------------------------------------------------------
#string STR_NO                                  #language en-US "No"
#string STR_YES                                 #language en-US "Yes"

#string STR_ME_FW_INFO_HELP                     #language en-US  "Multiple SKU selection \nMiniSku:\n ME + MeClock \nFull SKU:\n ME + AMT(whole AMT)+ MeClock + DT\nAuto Selection:\n Which kind of Me Firmware is it at present"
#string STR_ME_FW_INFO_PROMPT                   #language en-US  "ME Firmware"
#string STR_ME_FW_INFO_VALUE                    #language en-US  "N/A" //dynamically updated
#string STR_ME_NORMAL_MODE                      #language en-US  "Normal Mode"
#string STR_ME_FAILED                           #language en-US  "ME Failed"
#string STR_ME_TEMP_DISABLED                    #language en-US  "ME Temporarily Disabled"   
#string STR_ME_SECOVER                          #language en-US  "Secovr Jmpr/Heci MSG"   
#string STR_ME_ALT_DISABLED                     #language en-US  "ME ALT Disabled"
//#string STR_MIN_ME                              #language en-US  "Ignition sku firmware"
//#string STR_FULL_ME                             #language en-US  "Full sku firmware"
//#string STR_MIN_ME_FACTORY                      #language en-US  "Ignition - Factory Mode"
//#string STR_ME_SV_FW                            #language en-US  "SV Firmware"
//#string STR_ME_FW_VERSION_HELP                  #language en-US  "ME Firmware Version"
//#string STR_ME_FW_VERSION_PROMPT                #language en-US  "ME FW Version"
//#string STR_ME_FW_VERSION_VALUE                 #language en-US  "N/A" //dynamically updated

//#string STR_VE_FW_VERSION_HELP                  #language en-US  "VE Firmware Version"
//#string STR_VE_FW_VERSION_PROMPT                #language en-US  "VE FW Version"
//#string STR_VE_FW_VERSION_VALUE                 #language en-US  "N/A" //dynamically updated

//---------------------------------------------------------------------------
// Server ME Configuration
//---------------------------------------------------------------------------
#string STR_SERVER_ME_FORM                      #language en-US "Server ME Configuration"
#string STR_SERVER_ME_FORM_HELP                 #language en-US "Configure Server ME Technology Parameters"
#string STR_SERVER_ME_FORM_TITLE                #language en-US "Server ME Configuration"

#string STR_SERVER_ME_SUBTITLE                  #language en-US "General ME Configuration"

#string STR_ME_FWVER_OPERATIONAL_PROMPT         #language en-US "Operational Firmware Version"
#string STR_ME_FWVER_OPERATIONAL_HELP           #language en-US "Version of operational firmware selected to run."
#string STR_ME_FWVER_OPERATIONAL_VALUE          #language en-US "N/A"
#string STR_ME_FWVER_BACKUP_PROMPT              #language en-US "Backup Firmware Version"
#string STR_ME_FWVER_BACKUP_HELP                #language en-US "Version of backup operational firmware if present (optional)."
#string STR_ME_FWVER_BACKUP_VALUE               #language en-US "N/A"
#string STR_ME_FWVER_RECOVERY_PROMPT            #language en-US "Recovery Firmware Version"
#string STR_ME_FWVER_RECOVERY_HELP              #language en-US "Version of recovery firmware - runs when ME is in recovery mode."
#string STR_ME_FWVER_RECOVERY_VALUE             #language en-US "N/A"

// Display the SKU information
#string STR_ME_FWSKU_HELP                       #language en-US "Server ME firmware features list"
#string STR_ME_FWSKU_PROMPT                     #language en-US "ME Firmware Features"
#string STR_ME_FWSKU_VALUE                      #language en-US "N/A"

#string STR_ME_FWSTS1_HELP                      #language en-US "ME Firmware Status #1 register in HECI-1 configuration space."
#string STR_ME_FWSTS1_PROMPT                    #language en-US "ME Firmware Status #1"
#string STR_ME_FWSTS1_VALUE                     #language en-US "N/A"
#string STR_ME_FWSTS2_HELP                      #language en-US "ME Firmware Status #2 register in HECI-1 configuration space."
#string STR_ME_FWSTS2_PROMPT                    #language en-US "ME Firmware Status #2"
#string STR_ME_FWSTS2_VALUE                     #language en-US "N/A"
#string STR_ME_FWCURSTE_HELP                    #language en-US "ME firmware Current State, bits [3:0] in MEFS1."
#string STR_ME_FWCURSTE_PROMPT                  #language en-US "  Current State"
#string STR_ME_FWCURSTE_VALUE                   #language en-US "N/A"
#string STR_ME_FWERRCODE_HELP                   #language en-US "Server ME firmware Error Code, bits [15:12] in MEFS1."
#string STR_ME_FWERRCODE_PROMPT                 #language en-US "  Error Code"
#string STR_ME_FWERRCODE_VALUE                  #language en-US "N/A"
//
// TODO: Merge with memory settings
//
#string STR_SPSALTITUDE_PROMPT                  #language en-US "Altitude"
#string STR_SPSALTITUDE_HELP                    #language en-US "The altitude of the platform location above the see level, expressed in meters. The hex number is decoded as 2's complement signed integer.\nProvide the 80000000 value if the altitude is unknown."

#string STR_MCTP_BUS_OWNER_PROMPT               #language en-US "MCTP Bus Owner"
#string STR_MCTP_BUS_OWNER_HELP                 #language en-US "MCTP bus owner location on PCIe: [15:8] bus, [7:3] device, [2:0] function. If all zeros sending bus owner is disabled."

#string STR_SPS_SCC_PROMPT                      #language en-US "ICC Clock SSC"
#string STR_SPS_SCC_HELP                        #language en-US "Override SSC Setting for ICC Clock, or let firmware decide based on platform type (auto)"

#string STR_SME_BOOT_DEVICE_FORCE_PROMPT        #language en-US "Boot Device Override"
#string STR_SME_BOOT_DEVICE_FORCE_HELP	        #language en-US "Override the Boot Device Option readed from ME"
#string STR_HDD				                    #language en-US "Hard Drive"
#string STR_CD_DVD			                    #language en-US "CD/DVD"
#string STR_BIOS_SETUP			                #language en-US "BIOS Setup"
#string STR_USB				                    #language en-US "USB"

//---------------------------------------------------------------------------
// AMT configuration section
//---------------------------------------------------------------------------
#string STR_AMT_FORM                                    #language en-US "Manageability Application Configuration"
#string STR_AMT_FORM_HELP                               #language en-US "Configure Active Management Technology Parameters"
#string STR_AMT_SUBTITLE                                #language en-US "AMT Configuration"
#string STR_AMT_HELP                                    #language en-US ""

#string STR_AMT_PROMPT                                  #language en-US "Manageability App Enable"
#string STR_AMT_HELP                                    #language en-US "Enable/Disable Manageability Application and other manageability features. \nThis option will send a en/dis state message to firmware to toggle the manageability feature states."

#string STR_ME_FW_TYPE_PROMPT                           #language en-US "ME Firmware Type"
#string STR_ME_FW_TYPE_HELP                             #language en-US "ME Firmware Type"   
#string STR_ME_FW_TYPE_VALUE                            #language en-US "N/A" //dynamically updated
#string STR_ME_FW_TYPE_HELP                             #language en-US "ME Firmware Type (Workstation/HEDT or SPS)"
#string STR_ME_FW_TYPE_SPS                              #language en-US "SPS"
#string STR_ME_FW_TYPE_AMT                              #language en-US "Workstation/HEDT"
#string STR_ME_FW_TYPE_UNKNOWN                          #language en-US "Unknown"
#string STR_ME_FW_SKU_HELP                              #language en-US "ME Firmware SKU"
#string STR_ME_FW_SKU_PROMPT                            #language en-US "ME Firmware SKU"
#string STR_ME_FW_SKU_VALUE                             #language en-US "N/A" //dynamically updated
#string STR_ME_FILE_SYSTEM_CORRUPTION_HELP              #language en-US "Me File System Integrity Value"
#string STR_ME_FILE_SYSTEM_CORRUPTION_PROMPT            #language en-US "Me File System Integrity Value"
#string STR_ME_FILE_SYSTEM_CORRUPTION_VALUE             #language en-US "N/A" //dynamically updated 

#string STR_FW_UPGRADE_SUBTITLE                         #language en-US "Firmware Update Configuration"
#string STR_FW_UPGRADE_SUBTITLE_HELP                    #language en-US "Configure Management Engine Technology Parameters"
#string STR_AMT_ME_FW_DOWNGRADE_PROMPT                  #language en-US "Me FW Image Re-Flash"
#string STR_AMT_ME_FW_DOWNGRADE_HELP                    #language en-US "Enable/Disable Me FW Image Re-Flash function."
#string STR_AMT_LOCAL_FW_UPDATE_PROMPT                  #language en-US "Local FW Update"
#string STR_AMT_LOCAL_FW_UPDATE_HELP                    #language en-US "Options for Local FW Update function."

#string STR_MNG_STATE_PROMPT                            #language en-US "Manageability State"
#string STR_MNG_STATE_HELP                              #language en-US "Enable/Disable Intel Manageability features including AMT, CIRA, CILA."
#string STR_MDES_PROMPT                                 #language en-US "MDES Capability"
#string STR_MDES_HELP                                   #language en-US "MDES Capability state control"

#string STR_AMTBX_HOTKEY_PRESSED_PROMPT                 #language en-US "BIOS Hotkey Pressed"
#string STR_AMTBX_HOTKEY_PRESSED_HELP	                #language en-US "OEMFLag Bit 1:\nEnable/Disable BIOS hotkey press."
#string STR_AMTBX_SELECTION_SCREEN_PROMPT               #language en-US "MEBx Selection Screen"
#string STR_AMTBX_SELECTION_SCREEN_HELP	                #language en-US "OEMFLag Bit 2:\nEnable/Disable MEBx selection screen."
#string STR_AMT_HIDE_CONFIRMATION_UNCONFIGURE_ME_PROMPT #language en-US "Hide Un-Configure ME Confirmation Prompt"
#string STR_AMT_HIDE_CONFIRMATION_UNCONFIGURE_ME_HELP   #language en-US "OEMFlag Bit 6:\nHide Un-Configure ME without password Confirmation Prompt "
#string STR_AMT_MEBX_DEBUG_MSG_PROMPT                   #language en-US "MEBx Debug Message Output"
#string STR_AMT_MEBX_DEBUG_MSG_HELP                     #language en-US "OEMFlag Bit 14:\nEnable MEBx debug message output."
#string STR_AMT_UNCONFIGURE_ME_PROMPT                   #language en-US "Un-Configure ME"
#string STR_AMT_UNCONFIGURE_ME_HELP                     #language en-US "OEMFlag Bit 15:\nUn-Configure ME without password."

#string STR_AMT_CIRA_REQUEST_PROMPT                     #language en-US "Activate Remote Assistance Process"
#string STR_AMT_CIRA_REQUEST_HELP                       #language en-US "Trigger CIRA boot."
#string STR_AMT_USB_CONFIGURE_PROMPT                    #language en-US "USB Configure"
#string STR_AMT_USB_CONFIGURE_HELP                      #language en-US "Enable/Disable USB Configure function."
#string STR_AMT_PET_PROGRESS_PROMPT                     #language en-US "PET Progress"
#string STR_AMT_PET_PROGRESS_HELP                       #language en-US "User can Enable/Disable PET Events progress to recieve PET events or not."
#string STR_AMT_CIRA_TIMEOUT_PROMPT                     #language en-US "AMT CIRA Timeout"
#string STR_AMT_CIRA_TIMEOUT_HELP                       #language en-US "OEM defined timeout for MPS connection to be established.\n  0 - use the default timeout value of 60 seconds. \n  255 - MEBX waits until the connection succeeds"

//---------------------------------------------------------------------------
// EWS State Definitions
//---------------------------------------------------------------------------
#string STR_ME_EWS_STATE_PROMPT                         #language en-US "EWS State"
#string STR_ME_EWS_STATE_PROMPT_HELP                    #language en-US "Change EWS state using this option"

//---------------------------------------------------------------------------
// ME State control definitions
//---------------------------------------------------------------------------
#string STR_ME_STATE_CONTROL_PROMPT                     #language en-US "ME State"
#string STR_ME_STATE_CONTROL_HELP                       #language en-US "ME State Control help. Note **OEM** This is only a debug hook."

//---------------------------------------------------------------------------
// ASF Configuration
//---------------------------------------------------------------------------
#string STR_ASF_PROMPT                                  #language en-US "ASF"
#string STR_ASF_HELP                                    #language en-US "Enable/Disable Alert Specification Format."
#string STR_WATCHDOG_PROMPT                             #language en-US "WatchDog"
#string STR_WATCHDOG_HELP                               #language en-US "Enable/Disable WatchDog Timer."

#string STR_WATCHDOG_TIMER_OS_PROMPT                    #language en-US " OS Timer"
#string STR_WATCHDOG_TIMER_OS_HELP                      #language en-US "Set OS watchdog timer."
#string STR_WATCHDOG_TIMER_BIOS_PROMPT                  #language en-US " BIOS Timer"
#string STR_WATCHDOG_TIMER_BIOS_HELP                    #language en-US "Set BIOS watchdog timer."


//---------------------------------------------------------------------------
// MEBx Resolution Configuration
//---------------------------------------------------------------------------

#string STR_MEBX_FORM                                   #language en-US "MEBx Resolution Settings"
#string STR_MEBX_FORM_HELP                              #language en-US "Resolution settings for MEBx graphics mode and UI/non-UI text mode"

#string STR_MEBX_SUBTITLE                               #language en-US "Set MEBx resolutions"

#string STR_MEBX_NONUI_MODE_PROMPT                      #language en-US "Non-UI Mode Resolution"
#string STR_MEBX_NONUI_MODE_HELP                        #language en-US "Resolution for non-UI text mode"

#string STR_MEBX_UI_MODE_PROMPT                         #language en-US "UI Mode Resolution"
#string STR_MEBX_UI_MODE_HELP                           #language en-US "Resolution for UI text mode"

#string STR_MEBX_GRAPHICS_MODE_PROMPT                   #language en-US "Graphics Mode Resolution"
#string STR_MEBX_GRAPHICS_MODE_HELP                     #language en-US "Resolution for graphics mode"

#string STR_MEBX_MODE_AUTO                              #language en-US "Auto"
#string STR_MEBX_TEXT_80_25                             #language en-US "80x25"
#string STR_MEBX_TEXT_100_31                            #language en-US "100x31"

#string STR_MEBX_GRAPHICS_640_480                       #language en-US "640x480"
#string STR_MEBX_GRAPHICS_800_600                       #language en-US "800x600"
#string STR_MEBX_GRAPHICS_1024_768                      #language en-US "1024x768"

//---------------------------------------------------------------------------
// Intel Silicon View Technology(SVT) fo PCH definitions
//---------------------------------------------------------------------------
#string STR_SVT_FOR_PCH_PROMPT                  #language en-US "Intel SVT for PCH Capability"
#string STR_SVT_FOR_PCH_HELP                    #language en-US "Intel Silicon View Technology(SVT) for PCH Capability."

//---------------------------------------------------------------------------
// FW Debug Configuration definitions
//---------------------------------------------------------------------------
#string STR_FWDEBUG_FORM                        #language en-US "Server ME Debug Configuration"
#string STR_FWDEBUG_FORM_HELP                   #language en-US "Server ME firmware debug parameters configuration"
#string STR_FWDEBUG_FORM_TITLE                  #language en-US "Server ME Debug Configuration"

#string STR_SIEN_FORM                           #language en-US "Server ME General Configuration"
#string STR_SIEN_FORM_HELP                      #language en-US "Server ME basic features configuration"
#string STR_SIEN_FORM_TITLE                     #language en-US "Server ME General Configuration"

#string STR_NM_FORM                             #language en-US "NM Configuration"
#string STR_NM_FORM_HELP                        #language en-US "Options to configure NM features"
#string STR_NM_FORM_TITLE                       #language en-US "NM Configuration"

#string STR_DCMI_FORM                           #language en-US "DCMI Configuration"
#string STR_DCMI_FORM_HELP                      #language en-US "Options to configure DCMI features"
#string STR_DCMI_FORM_TITLE                     #language en-US "DCMI Configuration"

#string STR_ME_HMRFPOLOCK_PROMPT                #language en-US "HMRFPO_LOCK Message"
#string STR_ME_HMRFPOLOCK_HELP                  #language en-US "Enable/Disable sending HMRFPO_LOCK message to ME"

#string STR_ME_HMRFPOENABLE_PROMPT              #language en-US "HMRFPO_ENABLE Message"
#string STR_ME_HMRFPOENABLE_HELP                #language en-US "Enable/Disable sending HMRFPO_ENABLE message to ME"

#string STR_ME_ENDOFPOST_PROMPT                 #language en-US  "END_OF_POST Message"
#string STR_ME_ENDOFPOST_HELP                   #language en-US  "Enable/Disable sending END_OF_POST message to ME"

#string STR_ME_SHUTDOWN_PROMPT                 #language en-US  "ME Shutdown Message"
#string STR_ME_SHUTDOWN_HELP                   #language en-US  "Enable/Disable sending ME_SHUTDOWN message to ME when launching operating system"

#string STR_ME_GRLOCK_PROMPT                    #language en-US "Global Reset Lock"
#string STR_ME_GRLOCK_HELP                      #language en-US "Enable/Disable locking the joint ME and host reset capability"

#ifdef PCH_SPT
#string STR_ME_GRPROMOTION_PROMPT               #language en-US "CF9 global reset promotion"
#string STR_ME_GRPROMOTION_HELP                 #language en-US "Enable/Disable promoting CF9 reset to global"
#endif //PCH_SPT

#string STR_NM_BOOT_MODE_OVERRIDE_PROMPT        #language en-US  "Boot Mode Override"
#string STR_NM_BOOT_MODE_OVERRIDE_HELP          #language en-US  "Enables overriding the boot mode requested in NMFS register."
#string STR_NM_BOOT_MODE_PROMPT                 #language en-US  "  Boot Mode"
#string STR_NM_BOOT_MODE_HELP                   #language en-US  "The boot mode to use instead of the mode requested in NMFS register."
#string STR_POWER_OPTIMIZED                     #language en-US  "Power Optimized"
#string STR_PERF_OPTIMIZED                      #language en-US  "Performance Optimized"

#string STR_NM_CORES_DISABLE_OVERRIDE_PROMPT    #language en-US  "Cores Disable Override"
#string STR_NM_CORES_DISABLE_OVERRIDE_HELP      #language en-US  "Enables overriding the value of the number of cores to disable requested in NMFS register."
#string STR_NM_CORES_DISABLE_PROMPT             #language en-US  "  Cores To Disable"
#string STR_NM_CORES_DISABLE_HELP               #language en-US  "The number of cores to disable instead of the number requested in NMFS register."

#string STR_NM_POWERMSMT_OVERRIDE_PROMPT        #language en-US  "Power Measurement Override"
#string STR_NM_POWERMSMT_OVERRIDE_HELP          #language en-US  "Override power measurement support status reported to ME"
#string STR_NM_POWERMSMT_SUPPORT_PROMPT         #language en-US  "  Power Measurement"
#string STR_NM_POWERMSMT_SUPPORT_HELP           #language en-US  "Override power measurement support status reported to ME"

#string STR_NM_HWCHANGE_OVERRIDE_PROMPT         #language en-US  "Hardware Change Override"
#string STR_NM_HWCHANGE_OVERRIDE_HELP           #language en-US  "Override hardware change detection status reported to ME"
#string STR_NM_HWCHANGE_STATUS_PROMPT           #language en-US  "  Hardware Changed"
#string STR_NM_HWCHANGE_STATUS_HELP             #language en-US  "Override hardware change detection status reported to ME"

#string STR_ME_DID_ENABLE_PROMPT                #language en-US  "DRAM Init Done Enable"
#string STR_ME_DID_ENABLE_HELP                  #language en-US  "Enable/Disable notifying ME about DRAM initialization. (It Enables/Disables UMA functionality.)"

#string STR_ME_DID_TIMEOUT_PROMPT               #language en-US  "  DRAM Init Done Timeout"
#string STR_ME_DID_TIMEOUT_HELP                 #language en-US  "Enable/Disable waiting for DRAM initialization notify acknowledge from ME with 5 s timeout."

#string STR_ME_DID_INIT_STAT_PROMPT             #language en-US  "  DRAM Initialization Status"
#string STR_ME_DID_INIT_STAT_HELP               #language en-US  "Override the DRAM initialization status value."
#string STR_ME_DID_INIT_STAT_AUTO               #language en-US  "Auto - true status"
#string STR_ME_DID_INIT_STAT_0                  #language en-US  "0 - Success"
#string STR_ME_DID_INIT_STAT_1                  #language en-US  "1 - No Memory in Channels"
#string STR_ME_DID_INIT_STAT_2                  #language en-US  "2 - Memory Init Error"

#string STR_ME_ICC_SET_FIA_MUX_CONFIG_PROMPT                     #language en-US "Set FIA Mux Configuration"
#string STR_ME_ICC_SET_FIA_MUX_CONFIG_HELP                       #language en-US "If set than BIOS will send FIA Mux Configuration structure to ME"

#string STR_ME_HECI1ENABLE_PROMPT               #language en-US "HECI-1 Enable"
#string STR_ME_HECI1ENABLE_HELP                 #language en-US "Override HECI-1 status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_HECI2ENABLE_PROMPT               #language en-US "HECI-2 Enable"
#string STR_ME_HECI2ENABLE_HELP                 #language en-US "Override HECI-2 status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_HECI3ENABLE_PROMPT               #language en-US "HECI-3 Enable"
#string STR_ME_HECI3ENABLE_HELP                 #language en-US "Override HECI-3 status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_IDERENABLE_PROMPT                #language en-US "IDEr Enable"
#string STR_ME_IDERENABLE_HELP                  #language en-US "Override IDEr status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_KTENABLE_PROMPT                  #language en-US "KT Enable"
#string STR_ME_KTENABLE_HELP                    #language en-US "Override KT status on PCI, or let firmware decide based on ME type (auto)"

#string STR_ME_HECI1HIDEINME_PROMPT             #language en-US "HECI-1 Hide in ME"
#string STR_ME_HECI1HIDEINME_HELP               #language en-US "Enables sending request to ME to hide or disable HECI-1 on host PCI"
#string STR_ME_HECI2HIDEINME_PROMPT             #language en-US "HECI-2 Hide in ME"
#string STR_ME_HECI2HIDEINME_HELP               #language en-US "Enables sending request to ME to hide or disable HECI-2 on host PCI"
#string STR_ME_HECI3HIDEINME_PROMPT             #language en-US "HECI-3 Hide in ME"
#string STR_ME_HECI3HIDEINME_HELP               #language en-US "Enables sending request to ME to hide or disable HECI-3 on host PCI"

#string STR_BREAK_RTC_ENABLE_PROMPT             #language en-US "Break RTC Configuration"
#string STR_BREAK_RTC_ENABLE_HELP               #language en-US "This is a test option which breaks RTC configuration"

#string STR_TT_CUSTOM_LOW			            #language en-US "Thermal Throttling Low"
#string STR_TT_CUSTOM_LOW_HELP			        #language en-US "Custom option value for Thermal Throttling, low word"

#string STR_TT_CUSTOM_HIGH			            #language en-US "Thermal Throttling High"
#string STR_TT_CUSTOM_HIGH_HELP			        #language en-US "Custom option value for Thermal Throttling high word"

#string FW_IFACE_VER_DL				            #language en-US "Firmware Interface Version DeadLoop()"
#string ICC_MSG_DL				                #language en-US "ICC Command DeadLoop()"
#string DYN_FUSE_MSG_DL				            #language en-US "Dynamic Fusing Command"
#string DXE_OVR_DM_MODE				            #language en-US "OverrideMode for DM on DXE"
#string DXE_OVR_DNM_MODE			            #language en-US "OverrideMode for DNM on DXE"
#string DXE_OVR_PEI_MODE			            #language en-US "Grab from PEI"

#string STR_ME_TIMEOUT_PROMPT                   #language en-US "ME Initialization Complete Timeout"
#string STR_ME_TIMEOUT_HELP                     #language en-US "This option defines how long BIOS waits for ME to initialize."

#string STR_HOB_DBG				                #language en-US "HOB DBG"
#string STR_HOB_DBG_HLP				            #language en-US "HOB DBG HLP"

#string STR_IPMI_FRB_2ENABLE                    #language en-US "FRB-2 Enable"
#string STR_IPMI_FRB_2ENABLE_HELP               #language en-US "Fault Resilient Boot (FRB).\n\nBIOS programs the BMC watchdog timer for approximately 6 minutes. If BIOS does not complete POST before the timer expires, the BMC will reset the system."

#string STR_IPMI_FRB_TIMER                      #language en-US  "FRB-2 Watchdog Timer"
#string STR_IPMI_FRB_TIMER_HELP                 #language en-US  "BIOS programs the watchdog timer with the timeout value selected.  If BIOS does not complete booting before the timer expires, the ME will reset the system and an error will be logged."
#string STR_IPMI_FRB_TIMER_TIMEOUT              #language en-US  "FRB-2 Watchdog Timer Timeout"
#string STR_IPMI_FRB_TIMER_TIMEOUT_HELP         #language en-US  "If the FRB-2 Watchdog timer is enabled, this is the timeout value BIOS will use to configure the watchdog timer."
#string STR_IPMI_FRB_TIMER_POLICY               #language en-US  "FRB-2 Watchdog Timer Policy"
#string STR_IPMI_FRB_TIMER_POLICY_HELP          #language en-US  "If the FRB-2 Watchdog timer is enabled, this is the system action taken if the watchdog timer expires.\n\n[Reset] - System performs a reset.\n\n[Power Off] - System powers off."
#string STR_IPMI_FRB_TIMER_POWER_OFF            #language en-US  "Power Off"
#string STR_IPMI_FRB_TIMER_RESET                #language en-US  "Reset"
#string STR_IPMI_FRB_TIMER_POWER_CYCLE          #language en-US  "Power Cycle"
#string STR_TIME_20SEC                          #language en-US  "20 seconds"
#string STR_TIME_90SEC                          #language en-US  "90 seconds"
#string STR_TIME_5MIN                           #language en-US  "5 minutes"
#string STR_TIME_10MIN                          #language en-US  "10 minutes"
#string STR_TIME_15MIN                          #language en-US  "15 minutes"
#string STR_TIME_20MIN                          #language en-US  "20 minutes"

#string STR_PWR_RESTORATION_POLICY              #language en-US  "Power Restoration Policy"
#string STR_PWR_RESTORATION_POLICY_HELP         #language en-US  "This command can be used to configure the power restore policy"
#string STR_S0                                  #language en-US  "S0"
#string STR_PREVIOUS                            #language en-US  "Previous State"
#string STR_S5                                  #language en-US  "S5"
#string STR_NOCHANGE                            #language en-US  "No Change"

#string STR_ME_CORE_BIOS_DONE_PROMPT            #language en-US  "Core Bios Done Message"
#string STR_ME_CORE_BIOS_DONE_HELP              #language en-US  "Enable/Disable Core Bios Done message sent to ME"

#string STR_CLEAR_SEL_LOG                       #language en-US "Clear SEL"
#string STR_CLEAR_SEL_LOG_HELP                  #language en-US "Enable ClearSEL Ipmi Command"

#string STR_SPS_TIMER_CUSTOM                    #language en-US "Custom HPET timer for SPS HECI Waiting"


#string STR_ME_HSIO_ENABLE_PROMPT               #language en-US  "Enable Hsio messaging"
#string STR_ME_HSIO_ENABLE_HELP                 #language en-US  "Enable/Disable Hsio messaging"

#if ME_TESTMENU_FLAG

#string STR_ME_FIA_MUX_ENABLE_PROMPT            #language en-US  "Enable FIA MUX Message"
#string STR_ME_FIA_MUX_ENABLE_HELP              #language en-US  "Enable/Disable FIA Mux Configuration messaging"

#endif // ME_TESTMENU_FLAG

#string STR_ME_ENABLE_ME_PRE_DID_RESET_PROMPT   #language en-US  "Enable Pre-DramInitDone ME Reset"
#string STR_ME_ENABLE_ME_PRE_DID_RESET_HELP     #language en-US  "When SPS is in recovery, reset ME before DramInitDone message"
#string STR_ME_ENABLED                          #language en-US  "Enabled"
#string STR_ME_DISABLED                         #language en-US  "Disabled"
#string STR_ME_FORCED                           #language en-US  "Forced"